{
  "data": [
    {"Arria NLG – bugets and forecasts Narratives": "This project is generated as PoC under Future Finance vertical within RBS and intended for automatic\ncommentary / notes / narratives generation from bank’s statement reports using Arria.com NLG platform\nand using Tableau’s UI / story telling capabilities, intends to similify internal reporting to RBS group and to\nboard members. This would also help reduction in manual man hours spending on generating these texts"}
    ,{"Finance Portal (DRA: Disclosure Reporting Application)": "Across the Bank, is required to produce multiple disclosures (Statutory Compliance) which are submitted as\npart of quarterly result to regulators. The project uses standard and consistent / configurable reports\napproache to building disclosures using tech stack such as Python & Tornado, React & Html5 and Oracle\nPL/Sql. The server and UI is capable of handling all the traffic using asynchronous handles which are non\nblocking in nature. The data which we aggregate and represnt comes from various sources using Argon and\nare loaded by sqlloader files via python scripts and are automated in batches using autosys schedular"}
    ,{"FRC (Finance Reporting Cube) over OACS (Oracle Analytics Clound)": "platform is SaaS which has to be onboarded by GFS teams for management and budget reporting. My\n                        role is to build reports in smartviewand do the reconciliation over management and budge data. This is pure migration project from older reporting systems (INEA/KHALIX/WALKER) to OACS world"}
    ,{"CNMS (Cash Nostro Management System)": "I have written a proxy server for the project, the aim was to have a single instance accessing RBS cash\nbalances server and can give relevant data to authorised client. Clients identified by the IP address defined\nin a config file access to proxy server (socket implementation in python) can deliver the data back the\nconnected client via soap object. Its ondemand pull application directly from any client that access and soap\nclient handler installed can get the balances"}
    ,{"Miscellaneous": "I was also involved in non technology projects, reporting projects, migration projects and\nSupport L3 projects also."}
  ]
}
